app/views/shared/_user_info.html.erb

<h5>
<span><%= pluralize(current_user.microposts.count, "micropost") %></span>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]