app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "guo@test.com"]]
UPDATE "users" SET "activated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["activated_at", "2018-01-06 17:08:21.474571"], ["updated_at", "2018-01-06 17:08:21.475507"], ["id", 102]]
---
  def edit
    user = User.find_by(email: params[:email])
    if user && !user.activated? #&& user.authenticated?(:activation, params[:id])
      user.update_attribute(:activated,    true)