app/controllers/applies_controller.rb

  def create
    count = Apply.where("applies.user_id = #{current_user.id} and applies.friend_id = #{params[:friend_id]}")
    if (count != nil && count.as_json.length >= 1) || (current_user.id == params[:friend_id])
      flash[:error] = "发送好友申请失败"
      redirect_to chats_path
    else
      @apply = current_user.applies.build(:friend_id => params[:friend_id])
      if @apply.save
---
SELECT "applies".* FROM "applies" WHERE (applies.user_id = 1 and applies.friend_id = 10)
INSERT INTO "applies" ("friend_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["friend_id", "10"], ["user_id", "1"], ["created_at", "2018-01-08 08:53:35.153814"], ["updated_at", "2018-01-08 08:53:35.153814"]]