app/controllers/chats_controller.rb

  def create
    user=User.find_by_id(params[:users])

    current_user.chats.each do |chat|
      if (chat.users-[user, current_user]).blank?
        redirect_to chat_path(chat) and return
      end
    end

    @chat = Chat.new
    @chat.users<<user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "chats".* FROM "chats" INNER JOIN "chats_users" ON "chats"."id" = "chats_users"."chat_id" WHERE "chats_users"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "chats_users" ON "users"."id" = "chats_users"."user_id" WHERE "chats_users"."chat_id" = ?  [["chat_id", 1]]
INSERT INTO "chats" ("admin_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["admin_id", 1], ["name", "user2-user1"], ["created_at", "2018-01-05 09:07:25.862722"], ["updated_at", "2018-01-05 09:07:25.862722"]]

  def show
    notifies = Notify.where user: current_user, chat: @chat
    notifies.each do | notify |
        notify.destroy
---
SELECT "notifies".* FROM "notifies" WHERE "notifies"."user_id" = 2 AND "notifies"."chat_id" = 1
DELETE FROM "notifies" WHERE "notifies"."id" = ?  [["id", 1]]

  def set_chat
    @chat=Chat.find_by_id(params[:id])
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 1]]