app/controllers/friendships_controller.rb

SELECT "applies".* FROM "applies" WHERE (applies.user_id = 1 and applies.friend_id = 10)
SELECT  "applies".* FROM "applies" WHERE "applies"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "applies" WHERE "applies"."id" = ?  [["id", 1]]
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["friend_id", 4], ["user_id", 1], ["created_at", "2018-01-05 10:08:56.994310"], ["updated_at", "2018-01-05 10:08:56.994310"]]
---
  def create
    #Apply.where("applies.user_id=1 and applies.friend_id= 20")

 #   a = Apply.where("applies.user_id = 1 and applies.friend_id=20")
  #Apply Load (0.4ms)  SELECT "applies".* FROM "applies" WHERE (applies.user_id = 1 and applies.friend_id=20)
 #=> #<ActiveRecord::Relation [#<Apply id: 9, user_id: 1, friend_id: 20, created_at: "2018-01-08 06:37:59", updated_at: "2018-01-08 06:37:59">]>
#2.2.4 :019 > b = Apply.find(9)
 # Apply Load (0.2ms)  SELECT  "applies".* FROM "applies" WHERE "applies"."id" = ? LIMIT 1  [["id", 9]]
 #=> #<Apply id: 9, user_id: 1, friend_id: 20, created_at: "2018-01-08 06:37:59", updated_at: "2018-01-08 06:37:59">
#2.2.4 :020 > b.destroy
 #  (0.2ms)  begin transaction
  #SQL (0.5ms)  DELETE FROM "applies" WHERE "applies"."id" = ?  [["id", 9]]
   #(111.0ms)  commit transaction
 #<Apply id: 9, user_id: 1, friend_id: 20, created_at: "2018-01-08 06:37:59", updated_at: "2018-01-08 06:37:59">

    apply = Apply.where("applies.user_id = #{params[:friend_id]} and applies.friend_id = #{current_user.id}")
    a = apply.as_json
    b = a[0]
    c = b["id"]
    del = Apply.find(c)
    #@apply = current_user.applies.find_by(friend_id: params[:friend_id], user_id: current_user.id)
    if del.destroy
      @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
      if @friendship.save

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? LIMIT 1  [["user_id", 1], ["friend_id", 4]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "chats".* FROM "chats" INNER JOIN "chats_users" ON "chats"."id" = "chats_users"."chat_id" WHERE "chats_users"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "chats_users" ON "users"."id" = "chats_users"."user_id" WHERE "chats_users"."chat_id" = ?  [["chat_id", 1]]
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 2]]
---
  def destroy
    @friendship = current_user.friendships.find_by(friend_id: params[:id])
    @friendship.destroy

    user=User.find_by_id(params[:id])
    current_user.chats.each do |chat|
      if (chat.users-[user, current_user]).blank?
        chat.destroy