app/controllers/homes_controller.rb

  def home
  	@user = current_user
  	@micropost = current_user.microposts.build if logged_in?
  	@microposts = @user.microposts.paginate(page: params[:page]) if logged_in?
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]