app/controllers/messages_controller.rb

SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "messages" ("body", "user_id", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "123"], ["user_id", 1], ["chat_id", 2], ["created_at", "2018-01-05 10:09:05.898479"], ["updated_at", "2018-01-05 10:09:05.898479"]]
SELECT "users".* FROM "users" INNER JOIN "chats_users" ON "users"."id" = "chats_users"."user_id" WHERE "chats_users"."chat_id" = ?  [["chat_id", 1]]
INSERT INTO "notifies" ("user_id", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["chat_id", 1], ["created_at", "2018-01-08 08:15:02.889253"], ["updated_at", "2018-01-08 08:15:02.889253"]]
---
  def create
    @message = current_user.messages.build(message_params)
    chat=Chat.find_by_id(params[:chat_room])
    redirect_to chats_path, flash: {:warning => '此聊天不存在'} and return if chat.nil?
    @message.chat=chat
    if @message.save
      chat.users.each do | user |
        notify = Notify.create( user: user, chat: chat )