app/controllers/microposts_controller.rb

	def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "叶子"], ["picture", "b4c66c6ba3c7ba2dac937d4f91c25bc9.jpg"], ["user_id", 1], ["created_at", "2018-01-07 04:13:12.954286"], ["updated_at", "2018-01-07 04:13:12.954286"]]

  def destroy
  	@micropost.destroy
---
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 303]]