app/controllers/users_controller.rb

  def create
    @user=User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]

  def edit
    # 在tutorial中，有如下两句话，在此处并不适用correct_user 中定义了 @user 变量，
    # 所以可以把 edit 和 update 动作中的 @user 赋值语句删掉。
    # 注意，上面那两句花呗是错误的！
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 101]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "picture" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["picture", "aee99e235815407c5d223b068cb680e2.jpg"], ["updated_at", "2018-01-08 11:22:51.654073"], ["id", 1]]

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 100]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 100]]

  def index
    # @users = User.paginate(page: params[:page])
    @users=User.search(params).paginate(:page => params[:page], :per_page => 10)
---
SELECT  "users".* FROM "users" WHERE (users.name LIKE '%%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (users.name LIKE '%%')